Revit 2027 API
ViewDiscipline Enumeration
 Discipline of the view
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ViewDiscipline
Public Enumeration ViewDiscipline
public enum class ViewDiscipline
type ViewDiscipline
Members
Member name | Value | Description
Architectural | 1 |  Architectural
Coordination | 4,095 |  Coordination
Electrical | 8 |  Electrical
Mechanical | 4 |  Mechanical
Plumbing | 16 |  Plumbing
Structural | 2 |  Structural
See Also
Reference
Autodesk.Revit.DB Namespace